from unicodedata import name
from nonebot import on_command
from nonebot.rule import to_me
from nonebot.params import CommandArg
from nonebot.adapters.onebot.v11 import GroupMessageEvent,Bot,Message
import requests
import random
bainian = on_command("拜年", rule=to_me(), priority=5)
@bainian.handle()
async def handle_first_receive(event: GroupMessageEvent,message:Message=CommandArg()):
    
    args = str(event.get_message()).strip()  # 首次发送命令时跟随的参数，例：/天气 上海，则args为上海
    #if args:
        #state1["name"] = args  # 如果用户发送了参数则直接赋值


@bainian.got("name", prompt="你想给谁拜年呢")
async def handle_city(event: GroupMessageEvent,message:Message=CommandArg()):
    #name = state1["name"]
    essay=['一句平淡如水的问候，很轻;一声平常如纸的祝福，很真;摘一颗星，采一朵云，装入平安的信封里送给你，让快乐好运时刻围绕着你!你新年快乐!',
    '春节要来到，拜年要趁早。新年祝愿你：财源广进、家庭和谐、青春永驻、好运伴随、爱情甜蜜、身体健康、心情舒畅，快乐永远!',
    '虎年到了，愿你的事业如虎攀翠竹，扶摇直上;愿你的身体似虎般灵动，平安健康;愿你的工作像虎捕食猎物，充满激情;愿你的不幸像虎一样冬眠，沉睡不醒。愿你虎年快乐，幸福开心!',
    '钟声触动了心灵，烟花烂漫了心情，春晚活跃着喜庆，短信传递着祥和。大红灯笼挂千户，新春气息在洋溢，一串鞭炮若响起，是我的祝愿在送你。春节快乐!',
    '键盘敲敲，拇指点点，短信写写，祝福传传，铃声响响，屏幕闪闪，友情深深，心头暖暖，除夕闹闹，日历翻翻，心情美美，日子甜甜，祝愿声声，共贺新年!祝你虎年快乐！',
    '你是玫瑰你是花，娇艳美丽人皆夸。抚媚漂亮回首羡，楚楚动人亭玉雅。世间无敌你最靚，欲说先笑喜媚颜。春节到来花枝绽，上街走亲春满颜。春节快乐!',
    '恭祝你虎年：一家和和睦睦，一年开开心心，一生快快乐乐，一世平平安安，天天精神百倍，月月喜气扬扬，年年财源广进。',
    '有一种快乐飘飘洒洒，有一种生活平平淡淡，有一种美丽温温柔柔，有一种幸福安安静静，有一种拥有实实在在，有一种友情长长久久，有一个我祝你春节快乐。',
    '欢快的歌声尽情飘，温暖的春风暖心潮。万千的喜气多热闹，吉祥的日子要来到。发条短信问个好，财源广进吉星照。万事顺利开怀笑，虎年幸福乐逍遥。祝你虎年快乐！',
    '虎年春节祝福短信—深深的情谊与祝福，绵绵的思念与问候，在这特别的日子里，把祝愿随着短信带给远方的你：春节快乐!',
    '如期而至的不仅仅是节日，还有幸福和快乐。日渐增加的不仅是年龄，还有友情和健康。我的心里一如既往深深祝福:虎年万事如意!',
    '年年快快乐乐，岁岁平平安安，收入稳稳当当，钱包鼓鼓囊囊，全家高高兴兴，朋友风风雨雨，爱情卿卿我我，心意原原本本，愿您春节永远开开心心!',
    '瑞雪纷飞兆丰年，虎年到来笑哈哈。福运高照到你家，万事如意红包拿。身体健康疾病怕，家庭和睦人人夸。祝你虎年洋财发，生活快乐乐开花!',
    '你已经被我方新年快乐和万事如意包围了，乖乖接受祝福才是唯一的出路!否则将有更多的狗年大发雨、天天开心箭射向你!春节愉快!',
    '炮竹唱响喜乐心声，锣鼓宣扬幸福美满。舞狮高跷吉祥如意，星光灿烂盛世年夜。万家灯火映衬团圆，美酒香溢春年大宴。祝你大年喜乐唱，愿你健康幸福长!',
    '炮竹唱响喜乐心声，锣鼓宣扬幸福美满。舞狮高跷吉祥如意，星光灿烂盛世年夜。万家灯火映衬团圆，美酒香溢春年大宴。祝你大年喜乐唱，愿你健康幸福长!',
    '新春佳节,祝你虎年大吉大利，大显身手，虎气冲天!',
    '红红的灯笼高高挂，满满的吉祥冉冉升，香香的饺子裹幸福，诚诚的祝福传安康，春节到，愿你福禄双全，合家美满，春节愉快!',
    '给你虎虎的祝福，虎虎的甜蜜，虎虎的运气，虎虎的健康，虎虎的快乐，虎虎的心情，虎虎的欣慰，虎虎的顺利，虎虎的幸福，虎虎的人生!',
    '虎年大吉喜气临，昂首摆尾迎春来。双眼圆睁看世界，万水千山尽开颜。胡须翘翘美姿态，人人开心祝平安。巨大身躯摇摆摆，坎坷困境当笑谈。愿你虎年万事顺，吉星高照旺旺旺!',
    '新年的钟声即将敲响;幸福的航班即将起航;新的梦想马上绽放;迈开自信的步伐，我保证你未来的道路将会越来越顺畅，相信我没错的!',
    '春节将至，洋洋意气，欢乐绕屋，一团和气;朋友连心，心心相惜，惦记万千，一声祝福。福星高照，财禄寿喜，团团圆圆，吉祥如意。预祝您新年快乐!',
    '新年到了，将一声声贴心的问候，一串串真挚的祝福，一片片深厚的情意，乘着爱心的短信，穿越千山万水，飘进你的心坎。祝你春节快乐!',
    '小虎迎新送祝福：祝愿你虎年欢蹦乱跳身体壮如虎;祝愿友情天长地久更洁白无暇;祝愿社会温馨日子比蜜还要甜。',
    '岁月可以褪去记忆，却褪不去我们一路留下的欢声笑语。祝你新春快乐，岁岁安怡!',
    '虎起生活的风帆，走向虎关通途。向着虎年奔跑，达到吉虎未年，粘粘虎年的喜气。让美梦成真，叫理想变现，要祥瑞高照。愿你虎年喜虎虎，如日中天发虎财!',
    '我托空气为邮差，把热腾腾的问候装订成包裹，印上真心为邮戳，37度恒温快递，收件人是你，真心祝你:春节放假好!',
    '虎年到，虎年好，虎年鞭炮正欢闹。虎年来，虎年嗨，虎年祝福最精彩，愿你如虎般舞出自己的锦绣前程，如虎般游出自己的甜美爱情，如虎般点燃自己的美丽心情。虎年快乐，大吉大利。',
    '祝你好事接二连三，心情四季如春，生活五颜六色，七彩缤纷，偶尔八点小财，烦恼抛到九霄云外!请接受我十心十意的祝福!',
    '春节到，真热闹，家家团圆乐逍遥;吉祥话，说不完，朋友祝福莫嫌吵;祝愿你，心情好，生活幸福常微笑。祝新年快乐，一切都好!',
    '新年到，喜气跳，张灯结彩真热闹;鞭炮响，锣鼓喧，烟花绽放万家笑;吃饺子，闹团圆，家家欢喜把歌唱;写短信，送祝福，祝你新年乐逍遥。朋友，新年快乐!',
    '高雅的人，看背影就知道。奋进的人，听脚步就知道。和善的人，看笑脸就知道。自信的人，看眼神就知道。吉祥的人，看您就知道。祝新年快乐!',
    '思念是一季的花香，漫过山谷，而祝福是无边的关注，溢出眼睛，直到心底。愿节日的愉快伴你一生!',
    '一斤瓜子二斤枣，祝你好运来得早;三斤糖果四斤蕉，祝你吉祥不会跑;五斤花生六斤桃，祝你钱财滚滚进腰包!',
    '祝你在新的一年里，gpa高高，门门满绩！',
    '牛尾系着金拢财气，虎首摇着铃荡福音。风追逐着春天的行踪，雪漫步着温馨的海洋，灯点亮了回家的路程，无论你在远在近，我的祝福已经起航;祝你虎年快乐!',]
    number=random.randint(0,34)
    msg=essay[number]
    msg=msg.replace('你',str(name)).replace('您',str(name))
    await bainian.finish(msg)
